#include <iostream>

int main()
{
    int x[3];
    x[0] = 1;
    x[1] = 1;
    x[2] = 1;
    void *p0 = (void*)&x[0];
    //адреса идут через 4
    std::cout << (int)(&x[0]) << " " << 
                 (int)(&x[1]) << " " <<
                 (int)(&x[2]) << std::endl;
    //если через char*, то +4 даст второй элемент, а +1,+2,+3 мусор
    //выведет 1 16777216(m) 65536(m) 256(m) 1--это второй элемент
    std::cout << (int)(*((int*)((char*)p0 + 0))) << " " <<
                 (int)(*((int*)((char*)p0 + 1))) << " " <<
                 (int)(*((int*)((char*)p0 + 2))) << " " <<
                 (int)(*((int*)((char*)p0 + 3))) << " " <<
                 (int)(*((int*)((char*)p0 + 4))) << std::endl;
    //если через int*, то +1 даст второй элемент, а +2 третий
    //а +3 и +4 мусор
    //1 1 1 m m
    std::cout << (int)(*((int*)((int*)p0 + 0))) << " " <<
                 (int)(*((int*)((int*)p0 + 1))) << " " <<
                 (int)(*((int*)((int*)p0 + 2))) << " " <<
                 (int)(*((int*)((int*)p0 + 3))) << " " <<
                 (int)(*((int*)((int*)p0 + 4))) << std::endl;
}
